Revit 2027 API
ParameterTypeId.WallTopExtensionDistParam Property
 "Top Extension Distance"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallTopExtensionDistParam { get; }
Public Shared ReadOnly Property WallTopExtensionDistParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallTopExtensionDistParam {
	ForgeTypeId^ get ();
}
static member WallTopExtensionDistParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace